#include "common.h"
#include <libcd.h>
#include <libsnd.h>

#define FLAGS_PLAYERACTION_UNK02 0x00000002
#define FLAGS_PLAYERACTION_UNK04 0x00000004
#define FLAGS_PLAYERACTION_PLAYANIM 0x00000008
#define FLAGS_PLAYERACTION_HASSHADOW 0x00000020
#define FLAGS_PLAYERACTION_PAUSETRIGGERS 0x00000040
#define FLAGS_PLAYERACTION_HIDE 0x00080000
#define FLAGS_PLAYERACTION_CTRLSPEED 0x00200000
#define FLAGS_PLAYERACTION_PUSHABLE 0x01000000
#define FLAGS_PLAYERACTION_CTRLJUMP 0x02000000
#define FLAGS_PLAYERACTION_ATTACK 0x10000000
#define FLAGS_PLAYERACTION_COLLISIONOFF 0x40000000
#define FLAGS_PLAYERACTION_PUSHING 0x80000000

typedef struct {
    s16 a1, a2;
    s32 b, c, d, e, f;
} CamPos; /* size = 0x18 */

typedef struct {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
    s32 unk10;
    s32 unk14;
} UnkStruct1;

typedef struct {
    /* 000 */ s8* data;
    /* 004 */ s32 unk4;
    /* 008 */ s32 unk8;
    /* 00C */ s32 unkC;
    /* 010 */ s32 unk10;
    /* 014 */ s32 unk14;
    /* 018 */ s32 unk18;
    /* 01C */ s32 unk1C;
    /* 020 */ s32 unk20;
    /* 024 */ s32 unk24;
    /* 028 */ s8 unk28[0x10C];
    /* 134 */ s32 unk134;
    /* 138 */ s32 unk138;
    /* 13C */ s32* unk13C;
    /* 140 */ s32 unk140;
    /* 144 */ s32 unk144;
    /* 148 */ s32 unk148;
    /* 14C */ s32 unk14C;
    /* 150 */ s8 unk150[0x24];
    /* 174 */ s32 unk174;
    /* 178 */ s32 unk178;
    /* 17C */ s32 unk17C;
    /* 180 */ s32 unk180;
    /* 184 */ s32 unk184;
    /* 188 */ s32 unk188;
    /* 18C */ UnkStruct1* unk18C;
    /* 190 */ s32 unk190;
    /* 194 */ s32 unk194;
    /* 198 */ s8 unk198[0x1D0];
    /* 368 */ CamPos unk368;
    /* 380 */ s8 unk380[0x18];
    /* 398 */ CamPos unk398;
    /* 3B0 */ s8 unk3b0[0x24];
    /* 3D4 */ s32 shadowSize;
    /* 3D8 */ s8 shadowType;
} Strategy; /* size = ??? */

extern s32 CameraHold;
extern s32 CameraHeight;
extern s32 CameraDist;
extern s32 CameraDistUse;
extern Strategy* CameraLookAtStrat;
extern Strategy* CameraLookAtStrat2;
extern s32 GobboDir;
extern s32 GobboXPos;
extern s32 OldGobboCount;
extern s32 vb_timer;
extern s32 LevelReset;
extern s32 BonusDisplay;
extern void* CardDir;

void stCommandError(Strategy* st);
void stLoadObject(Strategy* st);
void stLoadSprite(Strategy* st);
void stLoadAnim(Strategy* st);
void stLoadSample(Strategy* st);
void stLoadAnimFlag(Strategy* st);
void stTurnTowardX(Strategy* st);
void stTurnTowardY(Strategy* st);
void stTurnTowardWaypointX(Strategy* st);
void stPlaySound(Strategy* st);
void stStopSound(Strategy* st);
void stPlayAnim(Strategy* st);
void stStopAnim(Strategy* st);
void stWaitAnimend(Strategy* st);
void stPrint(Strategy* st);
void stSpecialFXOn(Strategy* st);
void stWait(Strategy* st);
void stRepeat(Strategy* st);
